Tests/Functional/Controllers/Frontend/testdata/return-payload.json

{
  "module": "frontend",
  "controller": "WirecardElasticEnginePayment",
  "action": "return",
  "method": "wirecard_elastic_engine_credit_card",
  "__csrf_token": "5HYXXXXXXXXXXXXXXXXXXXXXXXXjh1",
  "api_id": "elastic-api",
  "authorization_code": "071085",
  "city": "Musterhausen",
  "completion_time_stamp": "20180724180441",
  "consumer_id": "20001",
  "country": "DE",
  "device_fingerprint": "2cfxxxxxxxxxxxxxxxxxxxxxxxxxx37d",
  "device_os": "linux",
  "device_type": "pc",
  "email": "test@example.com",
  "ip_address": "::1",
  "last_name": "Lastname",
  "locale": "de_DE",
  "masked_account_number": "401200******1003",
  "merchant_account_id": "53f2895a-e4de-4e82-a813-0d87a10e55e6",
  "notification_url_1": "http:\/\/localhost:8000\/WirecardElasticEnginePayment\/notify\/method\/wirecard_elastic_engine_credit_card",
  "order_number": "1532501234exxxf",
  "parent_transaction_amount": "45.940000",
  "parent_transaction_amount_currency": "EUR",
  "parent_transaction_id": "9c480af8-xxxx-XXXX-xxxx-9124b4204f7e",
  "payment_method": "creditcard",
  "phone": "05555 \/ 555555",
  "postal_code": "55555",
  "request_id": "249XXXXXXXXXxxxXXXXXXXXXxxxXXXXXXXXXxxxXXXXXXXXXXXXXXXXxxxXXXc87",
  "requested_amount": "45.940000",
  "requested_amount_currency": "EUR",
  "response_signature": "f452ca8b177bfd2b7ce8685127667df6e6a56ba22c0f408d454db0faec61e02b",
  "response_signature_v2": "SFMyNTYKdHJhbnNhY3Rpb25faWQ9NDAyZjM0OTktMTNiYS00NWI4LTkwMTEtZGJiMjkxZjQwMTMyCmNvbXBsZXRpb25fdGltZXN0YW1wPTIwMTgwNzI0MTgwNDQ0Cm1hc2tlZF9hY2NvdW50X251bWJlcj00MDEyMDAqKioqKioxMDAzCnRva2VuX2lkPTQzMDQ1MDk4NzM0NzEwMDMKYXV0aG9yaXphdGlvbl9jb2RlPTA3MTA4NQptZXJjaGFudF9hY2NvdW50X2lkPTUzZjI4OTVhLWU0ZGUtNGU4Mi1hODEzLTBkODdhMTBlNTVlNgp0cmFuc2FjdGlvbl9zdGF0ZT1zdWNjZXNzCmlwX2FkZHJlc3M9OjoxCnRyYW5zYWN0aW9uX3R5cGU9cHVyY2hhc2UKcmVxdWVzdF9pZD0yNDljNjIxMmQ4YTdkMTk5YjhlNTljNDIxYWFlZTdkMjg1MjAxMjliZGFmZmMzMzE1ZTlmZjEwN2RkNGY4Yzg3Cg==.yESACzaFsf4C6j2l6CIH8hp2PMr7fWGJZLaTvruITNI=",
  "self": "https:\/\/api-test.wirecard.com:443\/engine\/rest\/merchants\/53f2895a-e4de-4e82-a813-0d87a10e55e6\/payments\/402f3499-13ba-45b8-9011-dbb291f40132",
  "shipping_address_city": "Sch\u00f6ppingen",
  "shipping_address_country": "DE",
  "shipping_address_postal_code": "48624",
  "shipping_address_street1": "Mustermannstra\u00dfe 92",
  "status_code_1": "201.0000",
  "status_description_1": "3d-acquirer:The resource was successfully created.",
  "status_severity_1": "information",
  "street1": "Musterstr. 55",
  "token_id": "4304509873471003",
  "transaction_id": "402f3499-13ba-45b8-9011-dbb291f40132",
  "transaction_state": "success",
  "transaction_type": "purchase",
  "jsresponse": "true"
}